i = int(input("Введите число: "))
sotni = {
    0: "",
    1: "сто ",
    2: "двести ",
    3: "триста ",
    4: "четыреста ",
    5: "пятьсот ",
    6: "шестьсот ",
    7: "семьсот ",
    8: "восемьсот ",
    9: "девятьсот "
}
des = {
    0: "",
    2: "двадцать ",
    3: "тридцать ",
    4: "сорок ",
    5: "пятьдесят ",
    6: "шестьдесят ",
    7: "семьдесять ",
    8: "восемьдесять ",
    9: "девяносто "
}
ed = {
    0: "",
    1: "один ",
    2: "два ",
    3: "три ",
    4: "четыре ",
    5: "пять ",
    6: "шесть ",
    7: "семь ",
    8: "восемь ",
    9: "девять ",
    10: "десять ",
    11: "одиннадцать ",
    12: "двенадцать ",
    13: "тринадцать ",
    14: "четырнадцать ",
    15: "пятнадцать ",
    16: "шестнадцать ",
    17: "семнадцать ",
    18: "восемнадцать ",
    19: "девятнадцать "
}

if i in ed.keys():
    print(ed[i])
else:
    a = sotni[i//100]
    i %= 100
    if i in ed.keys():
        a += ed[i]
    else:
        a += des[i//10] + ed[i%10]
    print(a)
